Autodesk.Revit.DB.RepeatingReferenceSource.GetReference(Autodesk.Revit.DB.RepeaterCoordinates)
Returns an individual repeating reference given by coordinates in the array, or null if there is no reference at the coordinates (for example if there is a hole in a divided surface.)
Remarks:
The coordinates must be within the bounds of the repeating reference source.
coordinates:
The coordinates in the array of repeating references.
Returns:
The repeating reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The coordinates are not valid for the repeating reference source. This could be because of a mismatched dimensionality or because the coordinates are outside the bounds of the repeating reference source.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The repeating reference source is no longer valid.
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.GetBounds
Returns information about the boundaries of the repeating reference array.
Remarks:
See the Autodesk.Revit.DB.RepeaterBounds structure for more information about repeating reference source bounds.
Returns:
The bounds of the repeating reference source.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The repeating reference source is no longer valid.
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.GetDefaultRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns the default repeating reference source for a given element.
Remarks:
The element must support repeating references. Use HasRepeatingReferenceSource() to find out whether an element has any repeating references.
document:
The document that contains the element.
elementId:
The id of the element.
Returns:
The default repeating reference source of the given element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The element does not have any repeating reference sources.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.HasRepeatingReferenceSource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
document:
The document that contains the element.
elementId:
The id of the element.
Returns:
True if the element has any repeating reference sources.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource.DimensionCount
The dimension count of the repeating reference array.
Since:
2014

Autodesk.Revit.DB.RepeatingReferenceSource
Represents a collection of repeating references.
Remarks:
The RepeatingReferenceSource class is the building block for setting up component repeaters. Repeating references are arranged
in zero, one or two dimensional arrays. The RepeatingReferenceSource class represents this array of references
and provides access to individual repeating references.
Note that there may be gaps in the array (for example a repeating reference source formed by a divided surface with
holes, or is non-rectangular surface.)
Repeating reference sources are a property of an element. Only point elements, divided paths and divided surface elements
support repeating reference sources. These element respectively have 0, 1 and 2 dimensional repeating references.
Use the HasRepeatingReferenceSource() method to query whether an element supports repeating reference sources and the
GetDefaultRepeatingReferenceSource() method to obtain a repeating reference source from a given element.
See the Autodesk.Revit.DB.ComponentRepeater and Autodesk.Revit.DB.ComponentRepeaterSlot classes
for more information.
Since:
2014